In [1]:
import numpy as np
import pandas as pd

In [2]:
l = [1, 4, 577, 343]
l

[1, 4, 577, 343]

In [6]:
df = pd.DataFrame(l,
                  columns=['degisken_ismi'])
df

   degisken_ismi
0              1
1              4
2            577
3            343

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.axes

[RangeIndex(start=0, stop=4, step=1), Index(['degisken_ismi'], dtype='object')]

In [9]:
df.shape

(4, 1)

In [10]:
df.ndim

2

In [11]:
df.size

4

In [12]:
df.values

array([[  1],
       [  4],
       [577],
       [343]])

In [13]:
df.head(2)

   degisken_ismi
0              1
1              4

In [14]:
df.tail(2)

   degisken_ismi
2            577
3            343

In [15]:
a = np.array([1, 2, 3, 4, 56])

In [16]:
pd.DataFrame(a,
             columns=['degisken_ismi'])

   degisken_ismi
0              1
1              2
2              3
3              4
4             56

In [19]:
m = np.arange(1, 10).reshape(3, 3)

In [22]:
df = pd.DataFrame(m,
                  columns=['var1', 'var2', 'var3'])
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [23]:
df.columns = ('deg1', 'deg2', 'deg3')
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [24]:
df = pd.DataFrame(m,
                  index=['a', 'b', 'c'],
                  columns=['var1', 'var2', 'var3'])
df

   var1  var2  var3
a     1     2     3
b     4     5     6
c     7     8     9

In [25]:
bir = pd.Series([1, 2, 3, 4])
iki = pd.Series([1, 2, 3, 4])

In [26]:
pd.DataFrame({'degisken1': bir,
              'degisken2': iki})

   degisken1  degisken2
0          1          1
1          2          2
2          3          3
3          4          4

In [28]:
sozluk = {'reg' : {'RMSE': 10, 'MSE': 11, 'SSE': 90},
          'loj' : {'RMSE': 89, 'MSE': 12, 'SSE': 45},
          'cart': {'RMSE': 45, 'MSE': 22, 'SSE': 11}}
sozluk

{'reg': {'RMSE': 10, 'MSE': 11, 'SSE': 90},
 'loj': {'RMSE': 89, 'MSE': 12, 'SSE': 45},
 'cart': {'RMSE': 45, 'MSE': 22, 'SSE': 11}}

In [29]:
pd.DataFrame(sozluk)

      reg  loj  cart
RMSE   10   89    45
MSE    11   12    22
SSE    90   45    11

In [31]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

df = pd.DataFrame({'var1': s1, 'var2': s2, 'var3': s3})
df

   var1  var2  var3
0     3     2     4
1     1     2     0
2     5     2     1
3     9     9     5
4     9     6     2

In [32]:
df[0:1]

   var1  var2  var3
0     3     2     4

In [40]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

   var1  var2  var3
a     3     2     4
b     1     2     0
c     5     2     1
d     9     9     5
e     9     6     2

In [41]:
df['c':'e']

   var1  var2  var3
c     5     2     1
d     9     9     5
e     9     6     2

In [42]:
df.drop('a', axis=0)

   var1  var2  var3
b     1     2     0
c     5     2     1
d     9     9     5
e     9     6     2

In [43]:
df

   var1  var2  var3
a     3     2     4
b     1     2     0
c     5     2     1
d     9     9     5
e     9     6     2

In [44]:
df.drop('a', axis=0, inplace=True)

In [45]:
df

   var1  var2  var3
b     1     2     0
c     5     2     1
d     9     9     5
e     9     6     2

In [46]:
l = ['b', 'c']
l

['b', 'c']

In [48]:
df.drop(l, axis=0)

   var1  var2  var3
d     9     9     5
e     9     6     2

In [49]:
'var1' in df

True

In [50]:
l = ['var1', 'var2', 'var4']

In [52]:
df['var1'] is df['var1']

True

In [53]:
df['var2']

b    2
c    2
d    9
e    6
Name: var2, dtype: int64

In [54]:
df.var1

b    1
c    5
d    9
e    9
Name: var1, dtype: int64

In [55]:
l = ['var1', 'var2']
df[l]

   var1  var2
b     1     2
c     5     2
d     9     9
e     9     6

In [62]:
df['var4'] = df['var1'] / df['var2']

In [63]:
df

   var1  var2  var3  var4
b     1     2     0   0.5
c     5     2     1   2.5
d     9     9     5   1.0
e     9     6     2   1.5

In [64]:
df.drop('var4', axis=1, inplace=True)
df

   var1  var2  var3
b     1     2     0
c     5     2     1
d     9     9     5
e     9     6     2

In [65]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

df = pd.DataFrame({'var1': s1, 'var2': s2, 'var3': s3})
df

   var1  var2  var3
0     5     4     7
1     5     8     3
2     4     3     2
3     5     2     4
4     7     5     9

In [67]:
df.loc[0:3]

   var1  var2  var3
0     5     4     7
1     5     8     3
2     4     3     2
3     5     2     4

In [68]:
df.iloc[0:3]

   var1  var2  var3
0     5     4     7
1     5     8     3
2     4     3     2

In [69]:
df.iloc[0,0]

5

In [70]:
df.iloc[:3, :2]

   var1  var2
0     5     4
1     5     8
2     4     3

In [75]:
df.loc[:3, 'var1']

0    5
1    5
2    4
3    5
Name: var1, dtype: int64

In [72]:
df.loc[:3, 'var2':'var3']

   var2  var3
0     4     7
1     8     3
2     3     2
3     2     4

In [74]:
df.iloc[:4, 1:3]

   var2  var3
0     4     7
1     8     3
2     3     2
3     2     4

In [76]:
df.index = ['a', 'b', 'c', 'd', 'e']
df

   var1  var2  var3
a     5     4     7
b     5     8     3
c     4     3     2
d     5     2     4
e     7     5     9

In [77]:
df.loc['c':'d', 'var2':'var3']

   var2  var3
c     3     2
d     2     4

In [79]:
df[df.var1 > 5]['var2']

e    5
Name: var2, dtype: int64

In [83]:
df[(df.var1 > 5) & (df.var2 < 7)]

   var1  var2  var3
e     7     5     9

In [85]:
df.loc[df.var1 > 5, ['var1', 'var2']]

   var1  var2
e     7     5

In [86]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

df1 = pd.DataFrame({'var1': s1, 'var2': s2, 'var3': s3})
df1

   var1  var2  var3
0     1     7     9
1     4     8     0
2     8     0     1
3     8     4     3
4     8     4     9

In [88]:
df2 = df1+99
df2

   var1  var2  var3
0   100   106   108
1   103   107    99
2   107    99   100
3   107   103   102
4   107   103   108

In [91]:
pd.concat([df1, df2])

   var1  var2  var3
0     1     7     9
1     4     8     0
2     8     0     1
3     8     4     3
4     8     4     9
0   100   106   108
1   103   107    99
2   107    99   100
3   107   103   102
4   107   103   108

In [92]:
pd.concat([df1, df2], ignore_index=True)

   var1  var2  var3
0     1     7     9
1     4     8     0
2     8     0     1
3     8     4     3
4     8     4     9
5   100   106   108
6   103   107    99
7   107    99   100
8   107   103   102
9   107   103   108

In [98]:
df2.columns = ['var1', 'var2', 'deg3']
df2

   var1  var2  deg3
0   100   106   108
1   103   107    99
2   107    99   100
3   107   103   102
4   107   103   108

In [99]:
df1

   var1  var2  var3
0     1     7     9
1     4     8     0
2     8     0     1
3     8     4     3
4     8     4     9

In [100]:
pd.concat([df1, df2])

/home/amorf/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    deg3  var1  var2  var3
0    NaN     1     7   9.0
1    NaN     4     8   0.0
2    NaN     8     0   1.0
3    NaN     8     4   3.0
4    NaN     8     4   9.0
0  108.0   100   106   NaN
1   99.0   103   107   NaN
2  100.0   107    99   NaN
3  102.0   107   103   NaN
4  108.0   107   103   NaN

In [103]:
pd.concat([df1, df2], join='inner')

   var1  var2
0     1     7
1     4     8
2     8     0
3     8     4
4     8     4
0   100   106
1   103   107
2   107    99
3   107   103
4   107   103

In [104]:
pd.concat([df1, df2], join_axes=[df1.columns])

/home/amorf/.local/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
0     1     7   9.0
1     4     8   0.0
2     8     0   1.0
3     8     4   3.0
4     8     4   9.0
0   100   106   NaN
1   103   107   NaN
2   107    99   NaN
3   107   103   NaN
4   107   103   NaN

In [105]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Ezgi'],
                    'grup': ['Muhasebe', 'Mühendislik', 'Mühendislik', 'İK']})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3       Ezgi           İK

In [106]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Ezgi'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})
df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3       Ezgi       2019

In [107]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Mühendislik', 'İK'],
                    'müdür': ['Caner', 'Mustafa', 'Berkcan']})
df4

          grup    müdür
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [111]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe', 'Mühendislik', 'Mühendislik', 'İK', 'İK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux', 'excel', 'yönetim']})
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK    yönetim

In [112]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3       Ezgi           İK       2019

In [113]:
pd.merge(df1, df2, on='calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3       Ezgi           İK       2019

In [114]:
df3 = pd.merge(df1, df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Mühendislik       2014
2       Ayse  Mühendislik       2010
3       Ezgi           İK       2019

In [115]:
df4

          grup    müdür
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [116]:
pd.merge(df3, df4)

  calisanlar         grup  ilk_giris    müdür
0        Ali     Muhasebe       2009    Caner
1       Veli  Mühendislik       2014  Mustafa
2       Ayse  Mühendislik       2010  Mustafa
3       Ezgi           İK       2019  Berkcan

In [117]:
df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Mühendislik    kodlama
3  Mühendislik      linux
4           İK      excel
5           İK    yönetim

In [118]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3       Ezgi           İK

In [119]:
pd.merge(df1, df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Mühendislik    kodlama
3       Veli  Mühendislik      linux
4       Ayse  Mühendislik    kodlama
5       Ayse  Mühendislik      linux
6       Ezgi           İK      excel
7       Ezgi           İK    yönetim

In [121]:
df3 = pd.DataFrame({'name': ['Ali', 'Veli', 'Ayse', 'Ezgi'],
                    'maas': [70000, 80000, 120000, 90000]})
df3

   name    maas
0   Ali   70000
1  Veli   80000
2  Ayse  120000
3  Ezgi   90000

In [122]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayse  Mühendislik
3       Ezgi           İK

In [124]:
pd.merge(df1, df3, left_on='calisanlar', right_on='name')

  calisanlar         grup  name    maas
0        Ali     Muhasebe   Ali   70000
1       Veli  Mühendislik  Veli   80000
2       Ayse  Mühendislik  Ayse  120000
3       Ezgi           İK  Ezgi   90000

In [125]:
pd.merge(df1, df3, left_on='calisanlar', right_on='name').drop('name', axis=1)

  calisanlar         grup    maas
0        Ali     Muhasebe   70000
1       Veli  Mühendislik   80000
2       Ayse  Mühendislik  120000
3       Ezgi           İK   90000

In [128]:
df1a = df1.set_index('calisanlar')
df1a

                   grup
calisanlar
Ali            Muhasebe
Veli        Mühendislik
Ayse        Mühendislik
Ezgi                 İK

In [129]:
df2a = df2.set_index('calisanlar')
df2a

            ilk_giris
calisanlar
Ayse             2010
Ali              2009
Veli             2014
Ezgi             2019

In [133]:
pd.merge(df1a, df2a, left_index=True, right_index=True)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2009
Veli        Mühendislik       2014
Ayse        Mühendislik       2010
Ezgi                 İK       2019

In [134]:
df1a.join(df2a)

                   grup  ilk_giris
calisanlar
Ali            Muhasebe       2009
Veli        Mühendislik       2014
Ayse        Mühendislik       2010
Ezgi                 İK       2019

In [138]:
dfa = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Ezgi'],
                    'sıralama': [1, 2, 3, 4]})
dfa

  calisanlar  sıralama
0        Ali         1
1       Veli         2
2       Ayse         3
3       Ezgi         4

In [139]:
dfb = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Ezgi'],
                    'sıralama': [3, 1, 4, 2]})
dfb

  calisanlar  sıralama
0        Ali         3
1       Veli         1
2       Ayse         4
3       Ezgi         2

In [140]:
pd.merge(dfa, dfb, on='calisanlar')

  calisanlar  sıralama_x  sıralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3       Ezgi           4           2

In [144]:
pd.merge(dfa, dfb, on='calisanlar', suffixes=['_MAAS', '_DENEYİM'])

  calisanlar  sıralama_MAAS  sıralama_DENEYİM
0        Ali              1                 3
1       Veli              2                 1
2       Ayse              3                 4
3       Ezgi              4                 2